# vi:ft=ruby:
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'universal-ctags/universal-ctags'
tap 'caskroom/cask'

brew 'ruby-build'
brew 'tmux'
brew 'htop'
brew 'ncdu'
brew 'reattach-to-user-namespace'
brew 'vim', args: ['--override-system-vi']
brew 'zsh'
brew 'fzf'
brew 'lua'
brew 'neovim/neovim/neovim'
brew 'ag'
brew 'universal-ctags', args: %w[HEAD]
brew 'openssl'
brew 'autojump'
# brew 'memcached'
brew 'node'
brew 'redis'
brew 'sqlite'
brew 'python'
brew 'python3'
brew 'wget', args: ['--with-iri']
brew 'curl'
brew 'gawk'
brew 'pcre'
brew 'go'
brew 'git'
brew 'hub'
brew 'nvm'
brew 'erlang'
brew 'elixir'
brew 'gnupg2'
brew 'gpg-agent'
brew 'graphviz'
brew 'proctools'
brew 'pstree'
brew 'vnstat'
brew 'ipcalc'
# brew 'lsof'
brew 'homebrew/dupes/openssh'

# Install GNU core utilities (those that come with OS X are outdated).
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
# sudo ln -s /usr/local/bin/gsha256sum /usr/local/bin/sha256sum
brew 'coreutils'

# Install some other useful utilities like `sponge`.
brew 'moreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
brew 'gnu-sed', args: ['--with-default-names']
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'mongodb'
brew 'mariadb'
brew 'rabbitmq'
brew 'postgresql'
brew 'elasticsearch'
brew 'imagemagick', args: ['--with-webp']
# Install clojure tools
brew 'leiningen'
# brew 'youtube-dl'
brew 'ffmpeg', args: %w[--with-libvpx --with-libvorbis]
brew 'heroku-toolbelt'
brew 'the_silver_searcher'
brew 'heroku-toolbelt'
# heroku update

######################################### CASK ##########################################
cask_args appdir: '/Applications'
brew 'caskroom/cask/brew-cask'
cask 'dropbox'
cask 'evernote'
cask 'flux'
cask 'karabiner'
cash 'path-finder'
cask '1password'
cask 'slack'
# cask 'dashlane'
# cask 'spotify'
cask 'iterm2'
cask 'alfred'
# brew cask alfred link
cask 'java'
cask 'macvim'
cask 'heroku-toolbelt'
# cask 'charles'
cask 'skype'
cask 'skitch'
# cask 'google-chrome'
cask 'google-drive'
cask 'firefox'
cask 'opera'
cask 'caffeine'
# cask 'utorrent'
cask 'vlc'
cask 'cathode'
cask 'cyberduck'
cask 'atom'
cask 'tower'
# brew install git-lfs
# brew install git-flow
# brew install ack
# brew install dark-mode
# brew install rename
# brew install speedtest_cli
# brew install ssh-copy-id
# brew install tree
# xcode
# thunderbird
# navicat
# kindle
# istat menu
# brackets

