# vi:ft=ruby:
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'universal-ctags/universal-ctags'
tap 'caskroom/cask'
tap 'aykamko/tag-ag'

brew 'tag-ag'     # https://github.com/aykamko/tag
brew 'diff-so-fancy'
brew 'ruby-build' # manage rubies
brew 'tmux'
brew 'htop'
brew 'ncdu'       # to free space on disk
brew 'pgcli'      # better psql
brew 'zsh'
brew 'rpl'        # replace strings recursively http://www.laffeycomputer.com/rpl.html
brew 'fzf'
brew 'tig'        # git manager
brew 'lua'
brew 'luajit'
brew 'ag'         # https://github.com/ggreer/the_silver_searcher
brew 'pv'         # http://www.ivarch.com/programs/pv.shtml
brew 'openssl'
brew 'ranger'
brew 'autojump'   # navigate directories
# brew 'memcached'
brew 'node'
brew 'tree'
brew 'redis'
brew 'httpie'
brew 'sqlite'
brew 'keybase'    # http://keybase.io
brew 'python'
brew 'python3'
brew 'gawk'
brew 'pcre'
brew 'go'
brew 'git'
brew 'git-lfs'
brew 'hub'
brew 'nvm'
brew 'erlang'
brew 'elixir'
brew 'gnupg2'
brew 'gpg-agent'
brew 'graphviz'
brew 'highlignt'  # http://www.andre-simon.de/doku/highlight/en/highlight.php
brew 'proctools'
brew 'pstree'
brew 'vnstat'
brew 'ipcalc'
brew 'universal-ctags', args: %w(HEAD)
brew 'wget',            args: %w(--with-iri)
brew 'curl',            args: %w(--with-openssl --with-nghttp2)
# brew 'lsof'
brew 'homebrew/dupes/openssh'
brew 'ssh-copy-id' # macOS sierra has it default
brew 'reattach-to-user-namespace'
brew 'neovim/neovim/neovim'

# Install GNU core utilities (those that come with OS X are outdated).
# Don't forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
# sudo ln -s /usr/local/bin/gsha256sum /usr/local/bin/sha256sum
brew 'coreutils'

# Install some other useful utilities like `sponge`.
brew 'moreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'mongodb'
brew 'mariadb'
brew 'rabbitmq'
brew 'postgresql'
brew 'elasticsearch'
brew 'gnu-sed',     args: %w(--with-default-names)
brew 'imagemagick', args: %w(--with-webp)
brew 'ffmpeg',      args: %w(--with-libvpx --with-libvorbis)
# Install clojure tools
brew 'leiningen'
# brew 'youtube-dl' # download from youtube
brew 'heroku-toolbelt'
brew 'the_silver_searcher'
brew 'heroku-toolbelt'
# heroku update

######################################### CASK ##########################################
cask_args appdir: '/Applications'
brew 'caskroom/cask/brew-cask'
cask 'dropbox'
cask 'evernote'
cask 'flux'
cask 'karabiner'
cash 'path-finder'
cask '1password'
cask 'slack'
# cask 'dashlane'
# cask 'spotify'
cask 'iterm2'
cask 'alfred'
# brew cask alfred link
cask 'java'
cask 'macvim', args: %w(--with-cscope
                        --with-lua
                        --with-override-system-vim
                        --with-luajit
                        --with-python3)
# brew 'vim', args: ['--override-system-vi'] - macvim does this job
cask 'heroku-toolbelt'
# cask 'charles'
cask 'skype'
cask 'skitch'
# cask 'google-chrome'
cask 'google-drive'
cask 'firefox'
cask 'opera'
cask 'caffeine'
# cask 'utorrent'
cask 'vlc'
cask 'cathode'
cask 'cyberduck'
cask 'atom'
cask 'tower'
cask 'macdown'
# http://freemacsoft.net/appcleaner/

# brew install git-flow
# brew install dark-mode
# brew install rename
# brew install speedtest_cli
# xcode
# thunderbird
# navicat
# kindle
# istat menu
# brackets
